NUMBERS_FIRST_PART = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']
NUMBERS_SECOND_PART = ['13', '14', '15', '16', '17', '18', '19']

# приветственное сообщение

hello = f"Дорогой абитуриент, приветствую тебя!\n\n"
        f"Я рада видеть тебя в боте подготовки к ЕГЭ по истории.\n\n"
        f"Здесь ты найдёшь множество полезных заданий, которые помогут тебе успешно подготовиться к экзамену🔥\n\n"
        f"Что мы можем сделать вместе?\n\n"
        f"• порешать задания первой части\n"
        f"• порешать задания второй части\n"
        f"• позже тут появятся лекции и другие материалы\n\n"
        f"Давай сделаем этот путь интересным и полезным! Чтобы начать решать, нажми или напиши в чат «Хочу решать!»"

# первая кнопка
start_action_button = f"Хочу решать!"
# кнопка заданий первой части
first_part_button = f"Задания первой части"
# кнопка заданий второй части
second_part_button = f"Задания второй части"
# выбор чати экзамена
menu_text = f"Что порешаем?"
# первая часть
first_part_text = f"Какое задание из первой части порешаем?"
# вторая часть
second_part_text = f"Какое задание из второй части порешаем?"
# если неправильно ввел задание
incorrect_message = f"Твое сообщение некорректно!\nПопробуй еще разок выбрать что-то из заданий"
# неправильный ответ
wrong_answer = f'Мимо!\nПравильный ответ:'
# предложение порешать еще
solve_more_message = f"Порешаем что-то еще?"
# похвала
congrats = f"Молодец! Так держать! Порешаем еще?"
# прощание
goodbye = f"Хорошо! \nУдачного тебе дня! Пока!"
# текст для всех сообщений, которые некорректные
unexpected_message = f"Для начала работы нажми /start"
# текст для рассылки-напоминания
push = f"Тебя давно не видно! Возвращайся, чтобы порешать задания!"
